{
  "intents": [
    {
      "tag": "programming",
      "patterns": [
        "Tôi cần laptop để lập trình, bạn có gợi ý gì không?",
        "Laptop nào tốt cho coder?",
        "Máy nào phù hợp để lập trình?",
        "Tôi muốn tìm laptop cho developer.",
        "Tư vấn giúp tôi laptop cho việc viết code.",
        "Máy tính nào phù hợp cho sinh viên IT?",
        "Laptop nào phù hợp để học lập trình?",
        "Máy nào chạy được các IDE nặng như Android Studio?",
        "Tôi cần laptop lập trình game, bạn có gợi ý gì?",
        "Cần laptop để code, nên chọn loại nào?",
        "Máy nào phù hợp để lập trình Python?",
        "Laptop nào tốt để code web?",
        "Tôi muốn lập trình AI, cần laptop nào?",
        "Gợi ý laptop cho lập trình viên full-stack.",
        "Nên mua MacBook hay Windows để lập trình?",
        "Máy tính nào chạy tốt Visual Studio Code?",
        "Laptop nào phù hợp để học lập trình Java?",
        "Laptop nào tối ưu cho phát triển phần mềm?",
        "Nên chọn laptop nào để làm việc với dữ liệu lớn?",
        "Tôi cần laptop cho lập trình cơ bản, bạn có ý kiến gì không?",
        "Tìm laptop nào ngon để code đây nhỉ?",
        "Mua laptop để dev mà không biết chọn loại nào.",
        "Lập trình viên nên xài laptop gì nhỉ?",
        "Tôi code Python, nên mua máy gì ngon?",
        "Máy nào làm việc với data ổn áp nhỉ?",
        "Muốn chiến game và code thì mua laptop nào?",
        "Lập trình AI cần máy khỏe, bạn có gợi ý không?",
        "MacBook có phải lựa chọn tốt cho dân lập trình?",
        "Laptop nào xài mượt Android Studio vậy bạn?",
        "Để làm web, nên đầu tư laptop loại nào?",
        "Máy nào cân được vừa học vừa làm lập trình?",
        "Dev thì cần máy mạnh cỡ nào bạn nhỉ?",
        "Sinh viên IT mới vào học nên chọn laptop gì?",
        "Máy nào phù hợp cho front-end dev?",
        "Cần máy khỏe để chạy Docker, có loại nào tốt?",
        "Tôi muốn làm full-stack, nên mua laptop nào đây?",
        "Laptop nào thích hợp để làm việc từ xa và lập trình?",
        "Cần laptop pin trâu để học lập trình, bạn tư vấn được không?",
        "Máy nào chạy mượt Visual Studio Code và Git?",
        "Tìm laptop gọn nhẹ mà vẫn đủ mạnh để lập trình.",
        "Dev nghèo muốn mua laptop, chọn loại nào bây giờ?",
        "Cần máy để học code online, mua gì thì ổn?",
        "Máy nào vừa rẻ vừa chiến được mấy IDE nặng?",
        "Tôi chỉ làm back-end, có cần laptop xịn không?",
        "Làm mobile app dev thì cần laptop cấu hình ra sao?",
        "Máy nào ngon để code C++ và học lập trình hệ thống?",
        "Laptop nào cho người mới học lập trình là ổn?",
        "Tôi làm freelancer, cần laptop nào tiện mang theo?",
        "Nên chọn máy màn hình to hay nhỏ để code?",
        "Cần laptop giá dưới 20 triệu cho lập trình, chọn máy nào?",
        "Lập trình game thì laptop phải như thế nào?",
        "Sinh viên lập trình nên chọn máy mỏng nhẹ hay ưu tiên hiệu năng?",
        "Tôi hay làm việc đa nhiệm, cần laptop nào để chạy mượt?",
        "Máy nào chạy được Linux ổn định mà không đắt lắm?",
        "Muốn làm việc với Unity thì mua laptop gì bây giờ?",
        "Laptop nào tốt để dev và chơi game cùng lúc?",
        "Cần laptop cho việc debug nhanh, bạn gợi ý giúp?",
        "Tôi code cơ bản thôi, không cần máy mạnh lắm, chọn loại nào?",
        "Máy nào cho dân lập trình ưa di chuyển nhiều?",
        "Tôi muốn code mà pin trâu, laptop nào phù hợp?",
        "Làm việc với SQL và phân tích dữ liệu, chọn máy nào đây?",
        "Cần laptop cho machine learning, bạn tư vấn giúp!",
        "Laptop nào chạy đa nền tảng ổn để phát triển phần mềm?",
        "MacBook có phù hợp cho việc lập trình Windows app không?",
        "Muốn làm lập trình viên thì có cần đầu tư laptop đắt tiền không?",
        "Cần máy bền để làm việc dài hạn, gợi ý gì không?",
        "Làm việc nhóm remote thì chọn laptop nào hỗ trợ tốt?",
        "Laptop nào tối ưu cho việc code với Git và Docker?",
        "Tôi làm lập trình viên part-time, nên chọn laptop gì tiết kiệm?",
        "Laptop nào khởi động nhanh để làm việc với code?",
        "Cần laptop hỗ trợ đa màn hình, bạn có gợi ý không?"
      ],
      "responses": [
        "Bạn có thể cân nhắc MacBook Pro hoặc các dòng Dell XPS cho lập trình.",
        "Laptop với CPU mạnh như Intel i7 hoặc AMD Ryzen 7 là lựa chọn tốt cho lập trình.",
        "Nếu bạn làm việc với đồ họa hoặc AI, hãy chọn laptop có GPU rời như NVIDIA RTX.",
        "MacBook Air M2 rất phù hợp với lập trình viên làm việc trên môi trường macOS.",
        "ThinkPad của Lenovo nổi tiếng bền và hiệu suất cao, rất hợp với lập trình viên."
      ]
    },
    {
      "tag": "learning",
      "patterns": [
        "Laptop nào phù hợp cho việc học tập?",
        "Tôi cần máy tính để học, bạn tư vấn giúp.",
        "Nên chọn laptop nào cho học sinh?",
        "Laptop tốt nhất để học online là gì?",
        "Sinh viên nên dùng laptop nào?",
        "Máy tính nào bền để học đại học?",
        "Laptop giá rẻ nào phù hợp để học tập?",
        "Laptop nào pin trâu cho học sinh?",
        "Tôi muốn laptop để vừa học vừa làm.",
        "Máy nào đủ mạnh để học và giải trí nhẹ nhàng?",
        "Có laptop nào phù hợp cho việc học qua Zoom không?",
        "Tư vấn máy tính cho sinh viên không chuyên công nghệ.",
        "Tôi cần laptop cho việc học viết bài và làm bài tập.",
        "Có laptop nào nhẹ và dễ mang đi không?",
        "Máy tính nào tốt cho việc học và duyệt web?",
        "Tôi đang tìm laptop với giá khoảng 10 triệu để học tập.",
        "Laptop nào phù hợp cho sinh viên ngành xã hội học?",
        "Sinh viên IT nên chọn laptop học tập như thế nào?",
        "Máy tính nào phù hợp để học ngoại ngữ?",
        "Laptop nào học sinh cấp 3 nên sử dụng?",
        "Cần laptop giá rẻ học online, bạn tư vấn giúp?",
        "Máy nào ngon lành để vừa học vừa xem phim?",
        "Mua laptop cho con học cấp 2 thì chọn loại nào?",
        "Laptop nào phù hợp để làm bài thuyết trình và báo cáo?",
        "Sinh viên kinh tế nên dùng laptop gì để học?",
        "Máy nào gọn nhẹ mà vẫn đủ dùng để học hàng ngày?",
        "Cần laptop để học nhóm online, nên chọn loại nào?",
        "Sinh viên không rành công nghệ nên mua máy gì?",
        "Laptop nào xài Word, Excel, PowerPoint mượt mà?",
        "Tìm laptop giá dưới 15 triệu mà bền bỉ cho việc học?",
        "Có máy nào tốt cho học online mà không bị giật lag không?",
        "Laptop nào dùng lâu dài, không cần nâng cấp nhiều?",
        "Mua máy cho con học thêm online, loại nào phù hợp?",
        "Tôi cần laptop để học vẽ và thiết kế cơ bản, bạn gợi ý gì?",
        "Học sinh cấp 3 nên dùng máy nào để học tập hiệu quả?",
        "Laptop nào phù hợp để nghiên cứu và viết luận?",
        "Máy tính nào vừa học vừa làm slide thuyết trình tốt?",
        "Laptop nào thích hợp cho học từ xa qua Zoom, Teams?",
        "Muốn học ngoại ngữ online thì cần máy tính như thế nào?",
        "Tôi cần laptop để tự học qua các khóa trực tuyến.",
        "Cần laptop nhẹ để mang đi học thư viện, bạn gợi ý được không?",
        "Máy nào phù hợp cho sinh viên ngành truyền thông?",
        "Tìm laptop giá mềm để học và làm bài tập, chọn máy nào?",
        "Máy tính nào đủ pin để học cả ngày mà không cần sạc?",
        "Laptop nào chạy êm, không ồn, phù hợp học trong lớp?",
        "Tôi cần laptop cho việc đọc tài liệu và nghiên cứu, nên mua gì?",
        "Máy nào hỗ trợ tốt khi học với tài liệu PDF và eBook?",
        "Laptop nào đẹp và nhỏ gọn cho học sinh nữ?",
        "Có máy nào pin khỏe để học ngoài trời không?",
        "Laptop nào không quá đắt mà đủ cho việc học cả 4 năm đại học?",
        "Máy nào tốt để học các ngành thiên về văn hóa và xã hội?",
        "Cần laptop giá rẻ nhưng bền để học từ cấp 3 lên đại học.",
        "Máy nào ổn để vừa học vừa làm việc part-time?",
        "Có laptop nào giá sinh viên mà học lâu dài không?",
        "Mua laptop cho năm nhất đại học, nên chọn loại nào?",
        "Máy nào phù hợp để học các khóa MOOC như Coursera hay Udemy?",
        "Tìm laptop để ghi chép bài nhanh và hiệu quả, bạn gợi ý gì?",
        "Máy nào học online cả ngày mà không bị nóng?",
        "Laptop nào phù hợp cho sinh viên các ngành sáng tạo?",
        "Cần máy tốt để học online và thỉnh thoảng chơi game nhẹ?",
        "Máy nào phù hợp để học toán và làm bài tập trực tuyến?",
        "Laptop nào chạy được các ứng dụng học STEM như MATLAB?",
        "Cần laptop vừa đủ dùng để học và nghe nhạc thư giãn, bạn tư vấn được không?",
        "Sinh viên ngành ngoại ngữ thì mua laptop nào tiện nhất?",
        "Tôi cần laptop để học vẽ kỹ thuật số, bạn có gợi ý không?",
        "Có máy nào giá rẻ mà bàn phím gõ êm không?",
        "Laptop nào tốt để học các môn lập trình cơ bản mà không cần cấu hình cao?",
        "Máy nào bền để học đại học mà không phải sửa chữa nhiều?",
        "Tôi cần laptop cho việc học nhóm online và làm dự án nhóm.",
        "Học online bằng Google Meet cả ngày, nên mua máy nào?",
        "Máy nào tiện cho việc vừa học vừa ghi chú số lượng lớn?",
        "Tìm laptop để học các ngành nghiên cứu xã hội và nhân văn, nên mua gì?",
        "Laptop nào đủ mạnh để chạy các phần mềm phân tích dữ liệu cơ bản?",
        "Máy nào ổn định cho sinh viên ngành y khoa dùng lâu dài?",
        "Laptop nào tốt để học và lưu trữ tài liệu nhiều?",
        "Cần máy học tập nhưng loa phải nghe rõ để học ngoại ngữ online.",
        "Sinh viên học thiết kế nội thất thì dùng máy nào là tốt nhất?",
        "Máy nào hợp lý để học cả ngày và giải trí vào buổi tối?",
        "Laptop nào dễ sửa chữa nếu có sự cố, phù hợp cho sinh viên?",
        "Cần laptop để viết luận văn, bạn có gợi ý không?",
        "Máy nào thích hợp để học cách làm video cơ bản?",
        "Học viên cấp 3 muốn có laptop để học tốt môn Tin học, nên chọn loại nào?",
        "Laptop nào phù hợp để học các ngành quản trị kinh doanh?",
        "Tôi muốn học làm blog cá nhân, nên chọn máy nào?",
        "Cần laptop có webcam tốt để học online, bạn có đề xuất nào không?",
        "Laptop nào phù hợp để sinh viên học kết hợp các môn lý thuyết và thực hành?"
      ],
      "responses": [
        "Bạn có thể chọn các dòng laptop giá rẻ như Acer Aspire hoặc ASUS Vivobook.",
        "MacBook Air M1 là một lựa chọn tuyệt vời cho học tập và tính di động cao.",
        "Laptop với pin trâu như HP Pavilion sẽ phù hợp cho các buổi học dài.",
        "Nếu bạn cần màn hình lớn để đọc tài liệu, Dell Inspiron là một lựa chọn tốt.",
        "Chromebook rất phù hợp với học sinh và sinh viên, đặc biệt là giá cả phải chăng."
      ]
    },
    {
      "tag": "design",
      "patterns": [
        "Laptop nào phù hợp cho việc thiết kế đồ họa?",
        "Tôi cần laptop để dùng Photoshop, Illustrator.",
        "Có máy tính nào tốt cho designer không?",
        "Máy nào phù hợp để thiết kế 3D?",
        "Tư vấn laptop cho dân thiết kế nội thất.",
        "Tôi cần máy tính để học thiết kế đồ họa.",
        "Laptop nào tốt nhất để chạy Adobe Premiere?",
        "Nên chọn laptop nào cho công việc chỉnh sửa video?",
        "Máy nào phù hợp để làm kiến trúc?",
        "Laptop nào đủ mạnh để render video?",
        "Tôi cần laptop để vẽ kỹ thuật số.",
        "Có máy tính nào dành cho dân thiết kế không?",
        "Tư vấn máy tính để học thiết kế thời trang.",
        "Laptop nào tốt để làm việc với phần mềm AutoCAD?",
        "Máy nào phù hợp để sử dụng Blender?",
        "Tôi cần máy tính để chạy các phần mềm chỉnh sửa ảnh.",
        "Laptop nào tốt để dựng phim?",
        "Máy nào chạy được các phần mềm thiết kế nặng?",
        "Tôi cần laptop để chỉnh sửa ảnh và video chuyên nghiệp.",
        "Nên chọn máy nào để thiết kế poster, banner?",
        "Máy nào ngon để làm graphic design?",
        "Tìm laptop để chạy Photoshop và chỉnh sửa ảnh, chọn loại nào?",
        "Designer thì nên xài Mac hay Windows?",
        "Máy nào cân được After Effects mượt mà?",
        "Laptop nào đủ mạnh để render đồ họa 3D phức tạp?",
        "Cần máy tính nhẹ nhưng mạnh để thiết kế mọi nơi, gợi ý gì không?",
        "Tôi học thiết kế sản phẩm, nên chọn laptop nào?",
        "Có laptop nào tốt để chạy Sketch hoặc Figma không?",
        "Laptop nào màn hình đẹp để chỉnh màu sắc chuẩn?",
        "Cần laptop để dựng phim 4K, có loại nào phù hợp?",
        "Tìm máy tính làm đồ họa nhưng ngân sách hạn chế, chọn gì?",
        "Máy nào dành cho dân làm hoạt hình 3D?",
        "Tôi muốn laptop để học vẽ kỹ thuật số, bạn có gợi ý không?",
        "Máy nào có màn hình chuẩn màu cho dân thiết kế đồ họa?",
        "Cần laptop cho công việc thiết kế và chỉnh sửa hình ảnh, bạn gợi ý gì?",
        "Laptop nào chạy Premiere Pro và DaVinci Resolve ổn định?",
        "Sinh viên học thiết kế nội thất thì mua laptop nào tốt?",
        "Máy nào hỗ trợ tốt việc render 3D mà không bị giật lag?",
        "Cần laptop vừa học thiết kế vừa làm freelance, chọn loại nào?",
        "Laptop nào phù hợp để thiết kế UI/UX?",
        "Tìm laptop mỏng nhẹ mà vẫn đủ mạnh để thiết kế đồ họa?",
        "Máy nào giúp xử lý các file đồ họa nặng mà không bị chậm?",
        "Có laptop nào phù hợp với dân dựng phim nghiệp dư không?",
        "Laptop nào giá rẻ nhưng dùng tốt cho công việc chỉnh sửa ảnh?",
        "Máy nào tối ưu cho việc thiết kế thời trang?",
        "Tìm laptop để học các phần mềm như Maya, 3ds Max.",
        "Máy nào phù hợp để làm việc với CorelDRAW và InDesign?",
        "Laptop nào chạy được ZBrush mà không bị đứng?",
        "Tôi cần laptop để làm motion graphics, bạn gợi ý gì?",
        "Có laptop nào đủ mạnh để làm kỹ xảo và hiệu ứng không?",
        "Sinh viên kiến trúc nên mua máy nào để học và làm đồ án?",
        "Máy nào làm đồ họa nhưng pin khỏe để làm việc di động?",
        "Cần laptop với màn hình cảm ứng để vẽ trực tiếp, bạn tư vấn giúp.",
        "Laptop nào hỗ trợ tốt khi làm việc với màu sắc phức tạp?",
        "Tìm laptop để thiết kế và trình chiếu dự án, nên chọn gì?",
        "Cần laptop làm thiết kế đồ họa 2D và 3D, bạn gợi ý loại nào?",
        "Laptop nào hỗ trợ tốt khi làm việc với các tệp dung lượng lớn?",
        "Tìm laptop cho công việc thiết kế sách và in ấn, bạn gợi ý gì?",
        "Máy nào tốt để chạy bộ Adobe Creative Cloud?",
        "Cần laptop render video nhanh, bạn có gợi ý nào không?",
        "Laptop nào hỗ trợ tốt cho dân thiết kế đồ họa làm việc từ xa?",
        "Sinh viên học đồ họa nên đầu tư laptop loại nào?",
        "Tôi muốn làm thiết kế nội thất chuyên nghiệp, cần máy nào đủ mạnh?",
        "Laptop nào phù hợp để làm hình ảnh thương hiệu và logo?",
        "Tôi cần máy để học thiết kế thời trang online, nên mua gì?",
        "Máy nào chạy được cả Photoshop và Lightroom mượt mà?",
        "Có laptop nào giá phải chăng mà đủ cho việc làm đồ họa không?",
        "MacBook có phải lựa chọn tốt nhất để làm việc thiết kế không?",
        "Laptop nào chạy được phần mềm Rhino cho thiết kế kiến trúc?",
        "Tìm laptop để dựng video YouTube, nên chọn loại nào?",
        "Cần máy tính mạnh để làm đồ họa nhưng không quá nặng, bạn tư vấn được không?",
        "Laptop nào có GPU rời hỗ trợ thiết kế và chơi game cùng lúc?",
        "Tôi cần máy để thiết kế sản phẩm 3D, chọn loại nào?",
        "Cần laptop có độ phân giải màn hình cao để chỉnh ảnh, bạn gợi ý gì?",
        "Laptop nào bền và mượt để làm việc với các file đồ họa nặng?",
        "Tìm máy cho dân làm thiết kế game, bạn có gợi ý nào không?",
        "Máy nào tối ưu cho việc vẽ truyện tranh kỹ thuật số?",
        "Laptop nào dễ nâng cấp để dùng lâu dài cho thiết kế?",
        "Cần laptop làm đồ họa mà giá dưới 30 triệu, nên chọn loại nào?",
        "Tìm máy để làm thiết kế website và chỉnh giao diện, bạn gợi ý gì?",
        "Laptop nào giúp xuất file video nhanh và ổn định?",
        "Tôi cần laptop để dựng motion graphics và hiệu ứng đặc biệt.",
        "Cần máy chạy mượt cả Photoshop, Premiere Pro và After Effects.",
        "Laptop nào hỗ trợ vẽ kỹ thuật với bút cảm ứng tốt nhất?",
        "Tìm laptop học dựng hình 3D với Cinema 4D, chọn loại nào?",
        "Máy nào có màn hình OLED phù hợp cho công việc chỉnh màu sắc?",
        "Laptop nào nhỏ gọn mà vẫn cân được Blender và Maya?",
        "Tôi cần máy để học làm phim hoạt hình, bạn gợi ý gì?",
        "Cần laptop pin trâu để làm thiết kế di động, nên chọn máy nào?",
        "Tìm laptop cho công việc thiết kế đồ họa freelance.",
        "Máy nào phù hợp để tạo mockup cho các sản phẩm thương mại?",
        "Cần laptop để xử lý đồ họa và vẽ minh họa kỹ thuật số.",
        "Laptop nào đáp ứng được yêu cầu dựng video đa luồng?",
        "Máy nào hỗ trợ chỉnh sửa video 4K mượt và không giật lag?",
        "Tìm laptop với màn hình rộng để vẽ và thiết kế dễ dàng hơn.",
        "Cần máy để chạy Fusion 360 cho các dự án thiết kế cơ khí.",
        "Laptop nào giá mềm mà vẫn đủ mạnh để dựng 3D cơ bản?",
        "Có laptop nào tối ưu để học đồ họa nhưng không quá đắt không?",
        "Tôi cần laptop để học cách dựng phim từ đầu, chọn loại nào?",
        "Máy nào có màn hình xoay gập để tiện vẽ minh họa trực tiếp?",
        "Tìm laptop cân bằng giữa thiết kế đồ họa và tính di động.",
        "Laptop nào chạy ổn định Adobe XD và các công cụ UI/UX?",
        "Máy nào hỗ trợ tốt khi làm dự án thiết kế nội thất phức tạp?",
        "Cần laptop cho việc cắt ghép video nhanh chóng và mượt mà.",
        "Tôi cần máy tính làm việc trên các phần mềm CAD chuyên nghiệp.",
        "Laptop nào phù hợp để làm hiệu ứng kỹ xảo cho video?",
        "Máy nào giúp dựng 3D và vẽ concept art hiệu quả?",
        "Tìm máy để học thiết kế đồ họa từ cơ bản đến nâng cao.",
        "Laptop nào tốt để học thiết kế đồ họa 3D?",
        "Máy nào phù hợp cho công việc dựng phim và chỉnh sửa video?",
        "Tôi cần laptop để làm việc với các phần mềm đồ họa vector.",
        "Máy nào thích hợp để làm việc với các phần mềm mô phỏng 3D?",
        "Laptop nào hỗ trợ tốt cho việc làm đồ họa động và hoạt hình?",
        "Tôi cần laptop để học thiết kế UX/UI từ cơ bản đến nâng cao."
      ],
      "responses": [
        "MacBook Pro với M2 Max là lựa chọn hàng đầu cho thiết kế chuyên nghiệp.",
        "Dell XPS 15 có màn hình 4K tuyệt đẹp, rất hợp cho công việc đồ họa.",
        "MSI Creator Series được thiết kế đặc biệt cho dân thiết kế.",
        "Surface Laptop Studio là một sự kết hợp hoàn hảo giữa hiệu năng và tính di động.",
        "ASUS ProArt StudioBook là lựa chọn đáng cân nhắc với GPU mạnh mẽ."
      ]
    },
    {
      "tag": "entertain",
      "patterns": [
        "Tôi cần laptop để chơi game và nghe nhạc.",
        "Laptop nào phù hợp để xem phim dài tập không bị lag?",
        "Máy nào tốt để chơi game online với bạn bè?",
        "Tôi muốn laptop để tận hưởng giải trí đa phương tiện.",
        "Có laptop nào nhẹ để mang đi chơi và xem phim không?",
        "Máy tính nào hỗ trợ âm thanh Dolby Atmos cho giải trí?",
        "Tôi cần laptop để chơi các game Esports phổ biến.",
        "Có máy nào phù hợp để vừa chơi game vừa chỉnh ảnh cơ bản?",
        "Laptop nào tốt để stream nhạc và video chất lượng cao?",
        "Tôi muốn máy có màn hình OLED để xem phim sắc nét.",
        "Tôi cần laptop để xem phim và giải trí.",
        "Laptop nào tốt để chơi game và giải trí?",
        "Máy nào phù hợp để nghe nhạc và xem video?",
        "Tư vấn laptop cho việc giải trí đa phương tiện.",
        "Nên mua laptop nào để chơi game online?",
        "Tôi cần laptop để xem YouTube mượt mà.",
        "Có máy nào tốt để chơi game offline không?",
        "Tôi muốn laptop để xem Netflix chất lượng cao.",
        "Máy nào phù hợp để chơi game đồ họa thấp?",
        "Laptop nào có màn hình đẹp để xem phim?",
        "Tôi cần máy tính để giải trí cuối tuần.",
        "Máy nào tốt để nghe nhạc trên Spotify?",
        "Tư vấn laptop để chơi game nhẹ nhàng.",
        "Laptop nào có loa hay để nghe nhạc?",
        "Tôi muốn laptop để đọc truyện và xem phim.",
        "Máy tính nào phù hợp để học và giải trí nhẹ?",
        "Laptop nào có màn hình 4K để xem video?",
        "Có máy tính nào nhẹ và phù hợp để giải trí không?",
        "Tôi muốn máy tính để vừa học vừa chơi game nhẹ.",
        "Laptop nào có hiệu năng tốt với giá tầm trung?",
        "Máy nào phù hợp để chơi game giải trí sau giờ làm?",
        "Laptop nào chạy được các game online phổ biến như LOL, PUBG?",
        "Tôi muốn máy tính để xem phim chất lượng 4K UHD.",
        "Laptop nào bền để vừa học vừa xem phim lâu dài?",
        "Máy nào loa to và rõ để nghe nhạc hay?",
        "Tìm laptop để chơi các game Esports, bạn có gợi ý không?",
        "Laptop nào có màn hình đẹp để xem ảnh và video?",
        "Tôi cần laptop để giải trí với các bộ phim Netflix.",
        "Máy nào có khả năng chạy ổn định các game offline cổ điển?",
        "Laptop nào có tản nhiệt tốt để chơi game lâu không bị nóng?",
        "Cần laptop để nghe nhạc khi làm việc, bạn gợi ý gì không?",
        "Laptop nào pin lâu để xem phim trên chuyến đi dài?",
        "Máy nào nhẹ để mang đi du lịch và giải trí trên đường?",
        "Laptop nào phù hợp để vừa chơi game vừa làm việc?",
        "Tôi cần máy tính cho nhu cầu xem video TikTok mượt mà.",
        "Máy nào phù hợp để stream game hoặc nội dung giải trí?",
        "Laptop nào giá hợp lý để chơi các game đồ họa trung bình?",
        "Tôi muốn laptop có loa hay để hát karaoke online.",
        "Cần laptop để đọc sách điện tử và nghe podcast.",
        "Máy nào có thiết kế đẹp để vừa học vừa giải trí?",
        "Laptop nào hỗ trợ tốt khi chơi game và xem phim?",
        "Tìm máy tính cho mục đích xem phim gia đình, bạn tư vấn gì?",
        "Cần laptop để kết nối TV và xem phim lớn, chọn loại nào?",
        "Laptop nào có loa Dolby Atmos để xem phim sống động?",
        "Máy nào phù hợp để tải và chơi các game indie?",
        "Tôi muốn laptop để vừa học vừa giải trí nhẹ nhàng.",
        "Máy nào thích hợp để xem YouTube suốt cả ngày mà không nóng?",
        "Laptop nào chạy các ứng dụng nghe nhạc mượt mà?",
        "Tôi cần laptop để kết nối loa ngoài và nghe nhạc party.",
        "Máy nào phù hợp để chỉnh sửa video vlog đơn giản?",
        "Tôi cần laptop nhỏ gọn để giải trí trên quán cà phê.",
        "Laptop nào có bàn phím RGB để vừa chơi game vừa làm việc?",
        "Cần laptop để chơi các game mô phỏng như The Sims.",
        "Máy nào pin lâu để xem livestream mà không cần sạc?",
        "Tôi cần laptop để xem video dài trên YouTube không bị giật.",
        "Máy nào phù hợp để vừa làm đồ họa nhẹ vừa chơi game?",
        "Laptop nào có màn hình OLED phù hợp để xem phim chất lượng cao?",
        "Tìm laptop cho việc nghe audiobook và xem phim tài liệu.",
        "Laptop nào tối ưu để chơi game console qua cloud streaming?",
        "Tôi muốn laptop để chỉnh nhạc và nghe trên SoundCloud.",
        "Cần laptop mạnh để chơi các game AAA ở mức cài đặt thấp.",
        "Máy nào hỗ trợ màn hình cảm ứng để lướt web và xem phim dễ hơn?",
        "Tôi cần máy tính để tải game trên Steam và chơi thoải mái.",
        "Laptop nào chạy tốt Spotify và Apple Music cả ngày?",
        "Máy nào tích hợp webcam tốt để xem phim và gọi video giải trí?",
        "Cần laptop chơi game giá rẻ mà không nóng máy.",
        "Tôi cần laptop đa năng cho cả công việc và giải trí gia đình.",
        "Máy nào tốt để xem phim cùng gia đình vào cuối tuần?",
        "Cần laptop có âm thanh sống động để xem các buổi hòa nhạc online.",
        "Laptop nào phù hợp để chơi game với bạn bè online?",
        "Tôi cần máy để giải trí và lướt mạng xã hội mỗi ngày.",
        "Laptop nào pin khỏe để xem phim dài tập mà không lo sạc?",
        "Tìm laptop để chạy các ứng dụng nghe nhạc như Spotify, Deezer.",
        "Máy nào có màn hình rộng để xem phim với trải nghiệm như rạp chiếu phim?",
        "Cần laptop để chơi game FPS mượt mà, bạn gợi ý loại nào?",
        "Tôi muốn máy tính có loa tích hợp mạnh mẽ để nghe nhạc chất lượng cao.",
        "Laptop nào hỗ trợ tốt việc xem phim trực tuyến trên nền tảng như Disney+?",
        "Tôi cần laptop để chơi game nhẹ nhàng nhưng vẫn đẹp mắt.",
        "Máy nào đủ mạnh để xem phim trên các trang streaming quốc tế?",
        "Laptop nào có màn hình chống lóa để giải trí ngoài trời?",
        "Cần laptop chơi được các game như Minecraft hoặc Roblox.",
        "Tôi muốn laptop để chạy các app giải trí như YouTube Kids cho con nhỏ.",
        "Máy nào có âm thanh to rõ để xem video ca nhạc trực tuyến?",
        "Cần laptop bền để dùng lâu dài cho mục đích giải trí gia đình.",
        "Laptop nào tốt nhất để xem phim và làm đồ uống cùng bạn bè?",
        "Máy nào nhẹ và tiện để mang đi xem phim khi du lịch?",
        "Laptop nào tích hợp các công nghệ âm thanh cao cấp cho game thủ?",
        "Tôi cần laptop có màn hình đẹp để vừa xem video vừa làm việc.",
        "Máy nào chơi được các game đồ họa trung bình mà không giật lag?",
        "Tìm laptop với thời lượng pin lâu để không gián đoạn giải trí.",
        "Laptop nào phù hợp để xem phim hoạt hình và anime?",
        "Máy nào phù hợp để xem các kênh YouTube dạy nấu ăn?",
        "Cần laptop để nghe nhạc khi lái xe, có gợi ý nào không?",
        "Tôi muốn máy để chơi các game chiến thuật như Age of Empires.",
        "Laptop nào phù hợp để đọc truyện tranh online?",
        "Máy nào chạy ổn các phần mềm karaoke tại nhà?",
        "Cần laptop giá tầm trung để giải trí cuối tuần.",
        "Tìm laptop cân được các game mô phỏng nhẹ như Stardew Valley.",
        "Laptop nào giúp xem video từ các nền tảng học giải trí trực tuyến?",
        "Máy nào tích hợp cả chơi game và làm việc đa phương tiện?",
        "Cần laptop có màn hình HDR để xem nội dung sắc nét hơn.",
        "Tôi muốn máy để stream game lên YouTube hoặc Twitch.",
        "Laptop nào phù hợp để chơi các game cổ điển và giả lập?",
        "Tìm laptop cho việc tải và chỉnh sửa video TikTok.",
        "Laptop nào có loa tích hợp tốt để nghe nhạc live streaming?",
        "Tôi cần máy tính mạnh để chơi game đua xe.",
        "Máy nào chạy ổn định khi vừa giải trí vừa tải dữ liệu?",
        "Laptop nào tối ưu để xem phim Blu-ray trên ổ cứng di động?",
        "Tôi muốn máy nhẹ và bền để vừa học vừa xem phim giải trí.",
        "Máy nào đáp ứng cả chơi game FPS và chỉnh sửa ảnh cơ bản?",
        "Cần laptop với loa mạnh để xem phim hành động sống động."
      ],
      "responses": [
        "MacBook Air M2 với màn hình Retina rất tốt để xem phim và nghe nhạc.",
        "Dell Inspiron với màn hình FHD là lựa chọn tốt để giải trí đa phương tiện.",
        "HP Envy x360 có loa Bang & Olufsen cho trải nghiệm âm thanh tuyệt vời.",
        "Lenovo Legion 5 phù hợp để chơi game và giải trí với GPU mạnh.",
        "Acer Nitro 5 là lựa chọn tầm trung tốt cho cả giải trí và chơi game."
      ]
    },
    {
      "tag": "office",
      "patterns": [
        "Laptop nào nhẹ và tiện lợi để làm việc văn phòng khi đi công tác?",
        "Tôi cần laptop với thời gian pin dài để xử lý công việc cả ngày.",
        "Máy nào phù hợp để làm báo cáo tài chính và phân tích dữ liệu?",
        "Laptop nào tốt cho việc xử lý tài liệu PDF nhanh?",
        "Tôi cần laptop có bảo mật cao để bảo vệ dữ liệu văn phòng.",
        "Máy nào có khả năng chạy mượt Google Workspace và Microsoft Teams?",
        "Laptop nào tích hợp camera sắc nét để họp trực tuyến hiệu quả?",
        "Tôi muốn laptop hỗ trợ tốt khi làm việc với nhiều ứng dụng cùng lúc.",
        "Có laptop nào mỏng nhẹ nhưng bền và hiệu năng tốt cho văn phòng không?",
        "Máy nào phù hợp để quản lý dữ liệu khách hàng và bán hàng?",
        "Laptop nào phù hợp để làm việc văn phòng?",
        "Tôi cần máy tính để làm báo cáo và trình chiếu.",
        "Máy nào tốt để chạy Word, Excel, PowerPoint?",
        "Tư vấn laptop cho dân văn phòng.",
        "Nên chọn laptop nào cho công việc hành chính?",
        "Tôi muốn laptop pin trâu để làm việc cả ngày.",
        "Máy nào nhẹ và dễ mang theo khi đi làm?",
        "Có laptop nào phù hợp với dân kế toán không?",
        "Laptop nào chạy mượt Microsoft Office?",
        "Tôi cần máy tính để xử lý tài liệu lớn.",
        "Máy nào đủ bền để làm việc trong thời gian dài?",
        "Tôi cần laptop với bàn phím thoải mái để gõ văn bản.",
        "Có máy nào phù hợp để làm việc từ xa không?",
        "Tôi muốn laptop cho công việc và học thêm online.",
        "Laptop nào có webcam tốt để họp trực tuyến?",
        "Máy nào phù hợp để chạy phần mềm quản lý văn phòng?",
        "Laptop nào có màn hình chống chói để làm việc lâu?",
        "Tư vấn máy tính văn phòng dưới 15 triệu.",
        "Tôi cần laptop với hiệu năng ổn định để làm việc văn phòng.",
        "Máy tính nào phù hợp cho việc quản lý dự án?",
        "Máy nào phù hợp để làm việc văn phòng trong thời gian dài?",
        "Cần laptop nhẹ để di chuyển nhiều và làm việc từ xa.",
        "Tôi muốn máy tính để sử dụng Google Workspace mượt mà.",
        "Laptop nào tốt cho việc tạo và chỉnh sửa tài liệu văn bản?",
        "Máy nào phù hợp để tham gia các cuộc họp Zoom hàng ngày?",
        "Laptop nào có màn hình lớn để xử lý báo cáo tài chính?",
        "Tìm máy tính với thời lượng pin lâu để làm việc liên tục.",
        "Laptop nào có bàn phím thoải mái cho việc soạn thảo hợp đồng?",
        "Tôi cần laptop để làm việc với các bảng tính Excel phức tạp.",
        "Máy nào nhẹ nhưng đủ mạnh để chạy các phần mềm văn phòng?",
        "Laptop nào có thiết kế mỏng đẹp để sử dụng trong văn phòng hiện đại?",
        "Cần máy tính để trình chiếu và họp trực tuyến cùng lúc.",
        "Tôi muốn laptop tích hợp bảo mật vân tay để bảo vệ dữ liệu.",
        "Máy nào phù hợp để làm việc với phần mềm CRM?",
        "Laptop nào phù hợp cho dân văn phòng làm việc tại quán cà phê?",
        "Tôi cần máy tính với webcam sắc nét cho các buổi hội thảo online.",
        "Cần laptop giá dưới 20 triệu để làm việc văn phòng hàng ngày.",
        "Máy nào có ổ SSD lớn để lưu trữ tài liệu công ty?",
        "Tư vấn laptop vừa bền vừa mượt để xử lý công việc văn phòng.",
        "Laptop nào tốt cho công việc phân tích dữ liệu cơ bản?",
        "Tôi muốn máy tính với thiết kế sang trọng cho văn phòng cao cấp.",
        "Cần laptop để làm việc với nhiều file PDF và tài liệu lớn.",
        "Laptop nào có hệ thống tản nhiệt tốt để làm việc văn phòng lâu?",
        "Máy nào chạy ổn định các phần mềm quản lý dự án như Trello, Asana?",
        "Tôi cần laptop có kết nối HDMI để trình chiếu dễ dàng.",
        "Laptop nào nhỏ gọn để mang theo các chuyến công tác?",
        "Cần máy tính với màn hình FHD để làm việc văn phòng thoải mái.",
        "Máy nào phù hợp để xử lý email và tổ chức công việc hàng ngày?",
        "Tôi muốn laptop đủ mạnh để chạy các phần mềm phân tích số liệu.",
        "Laptop nào tốt để sử dụng cả ở văn phòng và tại nhà?",
        "Cần laptop pin khỏe cho các buổi làm việc ở ngoài trời.",
        "Máy nào tích hợp nhiều cổng kết nối cho công việc văn phòng?",
        "Tư vấn máy tính văn phòng cho dân kinh doanh và bán hàng.",
        "Laptop nào phù hợp để làm việc với phần mềm kế toán như MISA?",
        "Tôi cần laptop với màn hình sắc nét để làm việc với biểu đồ.",
        "Cần máy tính để quản lý kho hàng và các dữ liệu vận hành.",
        "Máy nào phù hợp để sử dụng các công cụ quản lý thời gian?",
        "Tôi muốn laptop vừa mạnh vừa tiết kiệm pin cho công việc hành chính.",
        "Laptop nào có bàn phím yên tĩnh để làm việc trong môi trường chung?",
        "Máy nào đáp ứng tốt nhu cầu làm việc với tài liệu đa ngôn ngữ?",
        "Cần laptop với ổ SSD tốc độ cao để xử lý công việc nhanh chóng.",
        "Tôi cần máy tính để sử dụng phần mềm ERP trong công ty.",
        "Laptop nào có loa chất lượng tốt để tham gia hội thảo trực tuyến?",
        "Máy nào phù hợp để tạo bài thuyết trình PowerPoint chuyên nghiệp?",
        "Tư vấn laptop với giá hợp lý để làm việc văn phòng cơ bản.",
        "Cần máy tính với màn hình cảm ứng để thao tác văn phòng dễ dàng.",
        "Tôi muốn laptop hỗ trợ nhiều ứng dụng văn phòng cùng lúc.",
        "Laptop nào đủ nhỏ gọn để mang theo trong balo hàng ngày?",
        "Máy nào phù hợp để xử lý công việc văn phòng và lưu trữ dữ liệu cá nhân?",
        "Máy nào phù hợp để xử lý công việc văn phòng cơ bản hàng ngày?",
        "Laptop nào có độ bền cao để sử dụng trong môi trường công nghiệp?",
        "Tôi cần laptop có khả năng kết nối nhanh với mạng LAN văn phòng.",
        "Cần máy tính tích hợp tốt với máy in và các thiết bị ngoại vi.",
        "Laptop nào hỗ trợ tốt việc chia sẻ tài liệu qua các nền tảng như Google Drive?",
        "Tìm laptop có thời lượng pin kéo dài để làm việc ngoài trời.",
        "Tôi muốn laptop có khả năng mở file lớn và chạy các phần mềm nặng.",
        "Laptop nào phù hợp để quản lý lịch trình và tổ chức công việc?",
        "Máy nào có màn hình xoay hoặc cảm ứng để thuyết trình tiện lợi?",
        "Tư vấn laptop có màn hình sắc nét để làm việc văn phòng liên tục.",
        "Tôi cần máy tính có thiết kế gọn nhẹ nhưng vẫn mạnh mẽ cho văn phòng.",
        "Laptop nào đáp ứng được việc chỉnh sửa tài liệu trên Word và Google Docs?",
        "Cần laptop có hiệu năng ổn định để xử lý nhiều tác vụ cùng lúc.",
        "Tôi muốn máy tính chạy nhanh và mượt khi dùng Outlook và Teams.",
        "Laptop nào hỗ trợ các phần mềm văn phòng như Quản lý nhân sự?",
        "Tôi muốn laptop cho công việc văn phòng và chỉnh sửa tài liệu ảnh nhẹ.",
        "Máy nào phù hợp để lưu trữ và quản lý tài liệu doanh nghiệp?",
        "Laptop nào có bàn phím backlit để làm việc vào ban đêm?",
        "Tôi cần laptop để tổ chức và điều hành các buổi họp qua video.",
        "Máy nào có webcam tích hợp chất lượng cao để họp trực tuyến chuyên nghiệp?",
        "Laptop nào phù hợp để kết nối đa màn hình trong văn phòng?",
        "Cần máy tính đủ mạnh để chạy các công cụ phân tích như Tableau.",
        "Tôi muốn laptop có bảo mật cao cho công việc văn phòng quan trọng.",
        "Laptop nào hỗ trợ chạy đồng thời nhiều ứng dụng văn phòng mà không bị giật lag?",
        "Máy nào phù hợp để theo dõi và quản lý dữ liệu khách hàng?",
        "Cần laptop chạy ổn định khi làm việc với file Excel hàng trăm MB.",
        "Laptop nào có hiệu suất tốt với giá cả phải chăng cho văn phòng nhỏ?",
        "Tôi muốn laptop có thời lượng pin lâu để làm việc khi mất điện.",
        "Cần laptop hỗ trợ trình chiếu qua cổng USB-C hoặc HDMI.",
        "Laptop nào tích hợp loa và mic chất lượng để làm việc từ xa?",
        "Máy nào phù hợp để ghi chép và soạn thảo nhanh trong các cuộc họp?",
        "Cần laptop chạy tốt phần mềm quản lý bán hàng và hóa đơn.",
        "Tôi muốn laptop sử dụng hệ điều hành Windows và dễ cài đặt phần mềm văn phòng.",
        "Laptop nào có độ phân giải cao để xem tài liệu và biểu đồ chi tiết?",
        "Tìm laptop với bộ nhớ RAM đủ lớn để chạy ứng dụng đồng thời.",
        "Tôi cần laptop hỗ trợ các phần mềm quản lý tài chính doanh nghiệp.",
        "Laptop nào phù hợp để làm việc nhóm qua Microsoft Teams hoặc Slack?",
        "Máy nào có trọng lượng nhẹ để dễ dàng di chuyển khi họp hành?",
        "Cần laptop giá rẻ nhưng vẫn đáp ứng công việc văn phòng cơ bản.",
        "Laptop nào tốt để chỉnh sửa nhanh tài liệu PDF?",
        "Tôi muốn máy tính có màn hình cảm ứng để thao tác nhanh khi làm việc.",
        "Laptop nào phù hợp để gửi email hàng loạt trong công việc marketing?",
        "Cần máy tính văn phòng hỗ trợ tốt việc quản lý tài khoản khách hàng.",
        "Laptop nào có bàn di chuột rộng và nhạy để thao tác nhanh?",
        "Tôi cần laptop chạy êm để sử dụng trong môi trường làm việc yên tĩnh.",
        "Máy nào hỗ trợ tốt khi làm việc với các công cụ như SharePoint?",
        "Laptop nào đáp ứng được yêu cầu thiết kế bảng biểu và đồ họa văn phòng nhẹ?",
        "Tìm máy tính có quạt tản nhiệt êm để không làm phiền đồng nghiệp.",
        "Tôi muốn laptop có màu sắc trung tính và thiết kế sang trọng.",
        "Cần laptop có màn hình lớn nhưng không quá cồng kềnh khi di chuyển."
      ],
      "responses": [
        "Lenovo ThinkPad E14 là lựa chọn tuyệt vời cho công việc văn phòng.",
        "MacBook Air M1 vừa nhẹ vừa mạnh, phù hợp với nhu cầu văn phòng.",
        "HP EliteBook với độ bền cao là lựa chọn đáng cân nhắc.",
        "Dell Latitude nổi tiếng với hiệu năng và tính bền bỉ, rất hợp dân văn phòng.",
        "Acer Swift 3 với pin lâu là lựa chọn tốt cho công việc hành chính."
      ]
    },
    {
      "tag": "no-content",
      "patterns": [
        "Hôm nay trời đẹp quá",
        "Bạn có biết bây giờ là mấy giờ không?",
        "Con mèo nhà tôi mới sinh con",
        "Tôi cần tư vấn về hoa kiểng",
        "Có nên đi chơi hôm nay không nhỉ?",
        "Tôi muốn biết cách làm món ăn này",
        "Bạn có thể chỉ tôi cách chụp ảnh đẹp không?",
        "Tôi muốn nói chuyện với bạn về thời tiết",
        "Nghe nói phim đó rất hay, bạn nghĩ sao?",
        "Tôi muốn học thêm về tiếng Anh",
        "Giá cả thị trường thay đổi như thế nào?",
        "Làm sao để tập yoga hiệu quả?",
        "Bạn biết chỗ nào sửa điện thoại tốt không?",
        "Có ai biết tin tức mới nhất về bóng đá không?",
        "Giải thích cho tôi về lý thuyết lượng tử",
        "Công thức nấu món phở bò là gì?",
        "Mùa này nên trồng loại cây gì?",
        "Tư vấn giùm tôi cách làm bánh sinh nhật",
        "Thời tiết ngày mai thế nào nhỉ?",
        "Có ai biết cách chăm sóc da hiệu quả không?",
        "Tôi muốn đăng ký lớp học múa",
        "Cách tiết kiệm điện trong gia đình là gì?",
        "Làm thế nào để nuôi dạy trẻ thông minh?",
        "Tôi thích đi du lịch, có gợi ý không?",
        "Phim nào đang hot trên Netflix?",
        "Ai là ca sĩ nổi tiếng hiện nay?",
        "Làm sao để viết một bài luận tốt?",
        "Bạn nghĩ sao về việc tập gym mỗi ngày?",
        "Có quán cà phê nào yên tĩnh không?",
        "Giải thích cho tôi về thuyết tương đối",
        "Tôi cần giúp đỡ với việc nuôi cá cảnh",
        "Có ai có kinh nghiệm chăm sóc cây xương rồng?",
        "Tư vấn giúp tôi chọn một chiếc xe đạp",
        "Làm thế nào để tăng cường sức khỏe?",
        "Bạn có thể chỉ tôi cách sửa máy giặt không?",
        "Có ai biết địa chỉ tiệm bánh ngon không?",
        "Cách trồng rau sạch tại nhà là gì?",
        "Giới thiệu cho tôi sách hay về tâm lý học",
        "Nên mặc trang phục gì cho buổi tiệc tối?",
        "Tôi muốn học cách vẽ tranh",
        "Bí quyết để giữ gìn sức khỏe tốt là gì?",
        "Bạn nghĩ sao về phong cách thời trang mới?",
        "Có nơi nào yên tĩnh để đọc sách không?",
        "Mua hoa quả ở đâu là an toàn?",
        "Tôi cần học cách giao tiếp hiệu quả",
        "Làm sao để có một giấc ngủ ngon?",
        "Tôi muốn nuôi chó, cần lưu ý gì?",
        "Bạn có đề xuất địa điểm du lịch nào?",
        "Tôi đang tìm cách học thêm về marketing",
        "Có cách nào giảm căng thẳng nhanh chóng không?",
        "Nên chọn loại cây gì cho bàn làm việc?",
        "Bạn biết về các công thức làm đẹp không?",
        "Tôi cần tư vấn về phong cách sống lành mạnh",
        "Có ai biết cách sửa bếp ga không?",
        "Làm sao để có kỹ năng lãnh đạo tốt?",
        "Tôi đang cần tìm lớp học làm đồ gốm",
        "Chào buổi sáng, bạn có khỏe không?",
        "Tôi vừa mua một chiếc xe mới, bạn nghĩ sao?",
        "Tôi vừa tham gia lớp học yoga, rất thú vị!",
        "Có thể giới thiệu cho tôi vài bộ phim hay không?",
        "Tôi đang tìm cách giảm cân hiệu quả, bạn có bí quyết nào không?",
        "Bạn có thể tư vấn giúp tôi về việc chọn quà sinh nhật?",
        "Mới đây tôi học được cách nấu món bánh mì rất ngon!",
        "Ai biết một quán cà phê yên tĩnh để làm việc không?",
        "Tôi muốn cải thiện khả năng viết lách của mình, bạn có lời khuyên nào không?",
        "Mình vừa mới xem một bộ phim rất hay, bạn đã xem chưa?",
        "Tôi đang học cách làm vườn, có thể cho tôi vài lời khuyên không?",
        "Làm sao để nuôi mèo tốt hơn?",
        "Tôi muốn bắt đầu học tiếng Trung, bạn có gợi ý gì không?",
        "Có thể chia sẻ những kỹ thuật làm vườn hiệu quả không?",
        "Tôi muốn học cách trang điểm, bạn có thể giúp không?",
        "Mới đây tôi bắt đầu học cách chơi guitar, rất vui!",
        "Tôi đang tìm một cuốn sách hay để đọc, có gợi ý nào không?",
        "Tôi cần chuẩn bị một chuyến du lịch, bạn có mẹo nào không?",
        "Bạn có thể giới thiệu những app học tiếng Anh nào tốt?",
        "Mới đây tôi tìm thấy một quán ăn rất ngon, bạn có biết không?",
        "Làm sao để quản lý thời gian hiệu quả hơn?",
        "Tôi muốn học cách làm đồ handmade, bạn có gợi ý gì không?",
        "Tôi đang tìm cách cải thiện khả năng nghe nhạc, bạn có lời khuyên gì?",
        "Tôi đang tìm các phương pháp giảm stress hiệu quả, có ai có gợi ý không?",
        "Tôi đang muốn học kỹ năng lãnh đạo, có khóa học nào phù hợp không?",
        "Tôi vừa mới tham gia một buổi hội thảo rất thú vị, bạn có tham gia không?",
        "Tôi muốn tìm hiểu về các loại cây trồng trong nhà, bạn có kinh nghiệm gì không?",
        "Tôi đang muốn mua một chiếc điện thoại mới, bạn có gợi ý nào không?",
        "Làm sao để cải thiện sức khỏe thể chất?",
        "Tôi muốn học cách vẽ tranh chân dung, có thể giúp tôi không?",
        "Mới đây tôi có mua một chiếc đồng hồ mới, bạn có thích không?",
        "Làm sao để làm việc hiệu quả hơn mỗi ngày?",
        "Tôi đang muốn học thêm về lập trình, có gợi ý nào không?",
        "Mình muốn tìm một quán ăn ngon ở Hà Nội, có ai biết không?",
        "Bạn có thể cho tôi biết cách trang trí phòng ngủ đẹp không?",
        "Mình đang muốn học cách làm bánh, có ai biết không?",
        "Tôi đang muốn cải thiện khả năng giao tiếp, có mẹo nào không?",
        "Tôi vừa tham gia một lớp học nấu ăn, rất thú vị!",
        "Có thể giới thiệu cho tôi một bộ phim hay không?",
        "Tôi muốn biết cách chăm sóc tóc, bạn có bí quyết gì không?",
        "Làm sao để có một lối sống lành mạnh và năng động?",
        "Tôi muốn bắt đầu học nhảy, có lớp học nào không?",
        "Làm sao để tiết kiệm tiền hiệu quả?",
        "Tôi muốn tìm một quán ăn sáng ngon, bạn có biết chỗ nào không?",
        "Có thể chia sẻ cho tôi về các mẹo sống tối giản không?",
        "Tôi muốn học về cách tạo dựng mối quan hệ trong công việc, có lời khuyên nào không?",
        "Bạn có thể giúp tôi tìm hiểu thêm về sự nghiệp phát triển cá nhân?"
      ],
      "responses": [
        "Xin lỗi, tôi không hiểu yêu cầu của bạn. Bạn có thể hỏi về các sản phẩm laptop hoặc dịch vụ của chúng tôi.",
        "Tôi không chắc là mình có thể giúp bạn với câu hỏi này. Vui lòng đặt câu hỏi về laptop hoặc các phụ kiện liên quan.",
        "Có vẻ như câu hỏi của bạn không liên quan đến lĩnh vực laptop. Bạn có thể hỏi tôi về các sản phẩm và tính năng laptop nếu cần hỗ trợ.",
        "Xin lỗi, tôi hiện tại chỉ hỗ trợ các câu hỏi liên quan đến laptop và các dịch vụ liên quan. Vui lòng thử lại với một câu hỏi khác.",
        "Bạn đang cần tư vấn về laptop? Vui lòng đặt câu hỏi rõ hơn để tôi có thể hỗ trợ bạn tốt hơn.",
        "Hiện tại, tôi chỉ cung cấp thông tin về các sản phẩm và phụ kiện laptop. Vui lòng thử đặt câu hỏi khác liên quan đến chủ đề này nhé!"
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "Xin chào",
        "Chào bạn",
        "Hello",
        "Hi",
        "Chào",
        "Chào bạn nhé",
        "Hey",
        "Xin chào, bạn khỏe không?",
        "Chào nhé",
        "Tôi muốn bắt đầu",
        "Cho tôi hỏi chút nhé",
        "Chào chatbot",
        "Xin chào bạn",
        "Chào nhân viên tư vấn",
        "Tôi muốn nói chuyện với bạn",
        "Tôi có thể giúp gì cho bạn?",
        "Bạn có đây không?",
        "Hello chatbot",
        "Chào bạn, có ai ở đây không?",
        "Xin chào, tôi cần hỗ trợ",
        "Chào bạn, hôm nay thế nào?",
        "Xin chào, tôi cần trợ giúp",
        "Hi, bạn có thể giúp tôi không?",
        "Chào bạn, bạn có sẵn sàng giúp tôi không?",
        "Hello, tôi muốn tìm hiểu về laptop",
        "Chào, tôi đang cần tư vấn",
        "Chào chatbot, tôi muốn hỏi về sản phẩm",
        "Hi, tôi có thể hỏi bạn về máy tính được không?",
        "Chào bạn, tôi muốn tìm hiểu thêm về laptop",
        "Xin chào, bạn có thể giúp tôi không?",
        "Chào, tôi đang tìm laptop cho công việc",
        "Hi! Tôi đang tìm hiểu về các sản phẩm laptop",
        "Hello, tôi cần giúp đỡ một chút về laptop",
        "Chào bạn, có thể giúp tôi tìm laptop phù hợp không?",
        "Xin chào, tôi muốn tư vấn về laptop cho công việc",
        "Chào bạn, tôi đang tìm laptop mới",
        "Chào bạn, tôi muốn tìm laptop cho học tập",
        "Hi, tôi cần tìm một chiếc laptop để chơi game",
        "Chào, tôi cần laptop cho công việc thiết kế đồ họa",
        "Xin chào, tôi đang muốn mua laptop để học trực tuyến",
        "Hello, tôi cần một chiếc laptop mạnh mẽ cho công việc",
        "Chào bạn, bạn có thể giới thiệu laptop cho sinh viên không?",
        "Hi, tôi cần tìm laptop giá rẻ nhưng vẫn mạnh mẽ",
        "Chào bạn, bạn có thể tư vấn về laptop cho tôi không?",
        "Chào chatbot, tôi cần tìm laptop với cấu hình cao",
        "Xin chào, tôi muốn mua laptop nhưng chưa biết chọn mẫu nào",
        "Hello, tôi muốn hỏi về các laptop mỏng nhẹ nhưng hiệu suất cao",
        "Chào bạn, bạn có thể giúp tôi tìm hiểu về các dòng laptop mới nhất không?",
        "Hi, tôi đang tìm một chiếc laptop phù hợp với nhu cầu công việc văn phòng",
        "Chào bạn, tôi muốn biết thông tin về laptop chơi game",
        "Xin chào, bạn có thể chỉ tôi laptop nào phù hợp với nhu cầu học tập?",
        "Chào, tôi đang tìm chiếc laptop vừa bền vừa đẹp",
        "Hi, bạn có thể giới thiệu laptop có màn hình đẹp không?",
        "Xin chào, tôi cần tư vấn về laptop cho việc chỉnh sửa video",
        "Chào bạn, tôi đang muốn nâng cấp laptop cũ",
        "Hello, bạn có laptop nào có thời gian sử dụng pin lâu không?",
        "Hi, tôi cần một chiếc laptop chạy mượt mà các phần mềm đồ họa",
        "Chào, tôi muốn biết laptop nào tốt cho việc học lập trình",
        "Xin chào, tôi đang tìm laptop có cấu hình mạnh mẽ cho việc chơi game",
        "Hello, tôi muốn tìm chiếc laptop có thiết kế đẹp và tiện lợi",
        "Chào bạn, tôi đang tìm laptop để phục vụ công việc văn phòng",
        "Chào bạn, tôi cần một chiếc laptop với dung lượng lưu trữ lớn",
        "Hi, bạn có laptop nào nhẹ và dễ mang theo không?",
        "Chào, tôi muốn hỏi về các tính năng của laptop Dell",
        "Chào bạn, tôi muốn tìm laptop chơi game với giá hợp lý",
        "Xin chào, tôi đang muốn mua laptop cho nhu cầu học trực tuyến",
        "Hi, bạn có thể giúp tôi tìm laptop có màn hình lớn không?",
        "Chào bạn, bạn có thể giới thiệu laptop có hiệu suất tốt cho việc làm việc đa nhiệm không?",
        "Hello, tôi cần một chiếc laptop có card đồ họa mạnh",
        "Xin chào, tôi cần tìm laptop có camera chất lượng tốt cho họp online",
        "Chào bạn, tôi đang tìm laptop có thiết kế mỏng nhẹ cho công việc",
        "Hi, tôi muốn biết laptop nào có tính năng bảo mật tốt",
        "Chào bạn, tôi cần laptop phù hợp với nhu cầu học và làm việc",
        "Hello, tôi muốn tìm laptop với hiệu suất cao nhưng giá hợp lý",
        "Chào bạn, tôi cần tìm laptop có thể chạy mượt các phần mềm văn phòng",
        "Xin chào, tôi muốn biết thêm về laptop dành cho sinh viên",
        "Chào bạn, tôi đang tìm laptop có bộ vi xử lý mạnh",
        "Hi, tôi cần laptop có khả năng chạy các phần mềm chỉnh sửa ảnh",
        "Chào, tôi đang tìm laptop có thời gian bảo hành dài",
        "Chào bạn, tôi cần laptop có bộ nhớ trong lớn để lưu trữ dữ liệu",
        "Hello, tôi muốn tìm laptop với màn hình cảm ứng",
        "Hi, tôi muốn hỏi về laptop có tính năng chống chói",
        "Chào, tôi muốn tìm laptop có khả năng kết nối tốt với các thiết bị khác",
        "Xin chào, bạn có thể giới thiệu cho tôi laptop có nhiều cổng kết nối không?",
        "Chào bạn, tôi cần laptop có thời gian khởi động nhanh",
        "Hi, tôi muốn mua một chiếc laptop có thể làm việc liên tục mà không bị nóng",
        "Chào bạn, bạn có laptop nào có tính năng tự động cập nhật phần mềm không?",
        "Hello, tôi đang tìm laptop có âm thanh tốt cho công việc và giải trí",
        "Xin chào, bạn có thể tư vấn giúp tôi về laptop tốt cho việc làm video không?",
        "Chào bạn, tôi cần laptop có khả năng sử dụng lâu dài mà không bị lỗi",
        "Hi, tôi cần một chiếc laptop mạnh mẽ nhưng dễ sử dụng",
        "Chào, tôi muốn tìm hiểu laptop cho học sinh cấp 3",
        "Chào bạn, bạn có thể tư vấn laptop phù hợp cho việc chỉnh sửa ảnh không?"
      ],
      "responses": [
        "Chào bạn! Bạn đang tìm laptop nào? Hãy cho tôi biết thêm để tôi có thể giúp bạn.",
        "Hi! Bạn cần tìm hiểu về sản phẩm laptop nào? Tôi có thể tư vấn cho bạn.",
        "Xin chào! Bạn cần hỗ trợ về laptop hay các dịch vụ liên quan đến công nghệ?",
        "Chào bạn! Nếu bạn cần tư vấn về các dòng laptop hoặc phụ kiện, tôi sẽ rất vui được giúp đỡ.",
        "Hello! Tôi có thể hỗ trợ bạn về các dòng laptop mới hoặc những thông tin bạn cần.",
        "Chào bạn, tôi luôn sẵn sàng để giúp bạn tìm kiếm laptop phù hợp với nhu cầu của mình.",
        "Hi! Nếu bạn có câu hỏi về laptop hoặc các thiết bị công nghệ, đừng ngần ngại hỏi tôi nhé!",
        "Chào bạn! Bạn đang cần tư vấn về laptop cho công việc, học tập hay giải trí?",
        "Xin chào, bạn có thể cho tôi biết bạn đang tìm kiếm một chiếc laptop như thế nào không?",
        "Hello, tôi sẽ giúp bạn chọn laptop phù hợp với nhu cầu của bạn. Cần trợ giúp gì không?"
      ]
    }
  ]
}



