{
  "intents": [
    {
      "tag": "find_laptop",
      "patterns": [
        "Tôi muốn tìm laptop của thương hiệu Dell.",
        "Có laptop nào giá dưới 15 triệu không?",
        "Bạn có thể giới thiệu laptop nào có màn hình 15 inch không?",
        "Tôi cần laptop có RAM 16GB, có loại nào không?",
        "Laptop nào phù hợp với ngân sách dưới 20 triệu?",
        "Cho tôi hỏi laptop của Apple có giá bao nhiêu?",
        "Bạn có laptop nào có màn hình cảm ứng không?",
        "Tôi muốn biết về laptop ASUS với cấu hình cao.",
        "Laptop nào có thể nâng cấp RAM lên 32GB?",
        "Tôi cần laptop chơi game giá tầm 30 triệu.",
        "Cho tôi biết các dòng laptop HP phổ biến.",
        "Laptop nào của Lenovo có màn hình 4K?",
        "Tôi muốn mua laptop Acer có ổ SSD 512GB.",
        "Bạn có laptop nào giá dưới 10 triệu không?",
        "Cho tôi biết các dòng laptop hỗ trợ cổng Thunderbolt.",
        "Laptop nào có pin dùng được hơn 8 tiếng?",
        "Tôi cần laptop có bàn phím đèn nền, bạn gợi ý gì không?",
        "Có laptop nào có GPU RTX 3060 không?",
        "Laptop nào tốt nhất trong tầm giá dưới 25 triệu?",
        "Tôi muốn laptop có màn hình 17 inch, bạn có không?",
        "Có loại laptop nào nhẹ mà mạnh không?",
        "Tôi cần laptop có cổng HDMI, có loại nào không?",
        "Laptop nào của ASUS tốt cho công việc văn phòng?",
        "Tôi muốn tìm laptop của Dell với giá tầm 20 triệu.",
        "Bạn có laptop nào với màn hình OLED không?",
        "Laptop nào phù hợp để sử dụng Photoshop?",
        "Tôi muốn laptop có dung lượng lưu trữ tối thiểu 1TB.",
        "Bạn có laptop nào với màn hình chống chói không?",
        "Tôi cần laptop có card đồ họa rời, bạn có gợi ý gì không?",
        "Laptop nào có thể dùng để học tập online tốt nhất?",
        "Tôi cần laptop chạy được Linux ổn định.",
        "Bạn có dòng laptop nào hỗ trợ Wi-Fi 6 không?",
        "Tôi cần laptop cho công việc thiết kế đồ họa.",
        "Laptop nào hỗ trợ sạc nhanh tốt nhất?",
        "Bạn có laptop nào với thiết kế mỏng nhẹ không?",
        "Tôi cần laptop có bộ xử lý Intel i7, có loại nào không?",
        "Có laptop nào của HP với màn hình cảm ứng không?",
        "Tôi muốn laptop có loa tốt để nghe nhạc.",
        "Laptop nào có bảo mật vân tay tích hợp?",
        "Bạn có dòng laptop nào của Microsoft không?",
        "Tôi muốn mua MacBook Air, có sẵn không?",
        "Laptop nào có thể chạy các ứng dụng AI tốt?",
        "Tôi cần laptop có pin bền nhất.",
        "Bạn có laptop nào hỗ trợ đa màn hình không?",
        "Tôi muốn laptop với GPU NVIDIA mạnh mẽ.",
        "Laptop nào hỗ trợ kết nối Bluetooth 5.0 tốt?",
        "Bạn có dòng laptop nào của Acer với RAM 8GB không?",
        "Tôi muốn biết laptop nào hỗ trợ cổng USB-C.",
        "Có laptop nào với màn hình độ phân giải 2K không?",
        "Tôi cần laptop hỗ trợ học online qua Zoom.",
        "Laptop nào của Lenovo có thiết kế bền bỉ?",
        "Tôi muốn tìm laptop của Razer cho game thủ.",
        "Laptop nào hỗ trợ đồ họa 3D tốt?",
        "Tôi cần laptop có màn hình lớn hơn 15 inch.",
        "Bạn có laptop nào dành cho doanh nhân không?",
        "Laptop nào tốt nhất cho công việc chỉnh sửa video?",
        "Tôi muốn mua laptop với giá tốt nhất trong tháng này.",
        "Có laptop nào chạy macOS không?",
        "Laptop nào có thời gian khởi động nhanh nhất?",
        "Bạn có dòng laptop nào với CPU AMD Ryzen 7 không?",
        "Tôi cần laptop có hệ thống làm mát tốt.",
        "Laptop nào có webcam sắc nét nhất?",
        "Tôi muốn mua laptop với màn hình gập linh hoạt.",
        "Bạn có laptop nào hỗ trợ chạy Docker không?",
        "Laptop nào có dung lượng RAM tối đa là 64GB?",
        "Tôi muốn laptop có tốc độ xử lý nhanh nhất.",
        "Bạn có laptop nào của Dell cho dân coder không?",
        "Tôi muốn laptop chạy được các phần mềm quản lý doanh nghiệp.",
        "Có laptop nào của HP với màu vàng không?",
        "Laptop nào có hiệu năng tốt nhất để chơi game?",
        "Tôi cần laptop có khả năng chạy Visual Studio Code mượt mà.",
        "Bạn có laptop nào với ổ cứng NVMe không?",
        "Tôi muốn laptop có màn hình sắc nét để chỉnh sửa ảnh.",
        "Laptop nào có dung lượng pin lớn nhất hiện nay?",
        "Bạn có laptop nào của ASUS hỗ trợ chơi game không?",
        "Tôi cần laptop có độ phân giải Full HD tối thiểu.",
        "Có laptop nào của Lenovo với giá rẻ không?",
        "Laptop nào phù hợp để vừa làm vừa chơi game?",
        "Bạn có laptop nào với RAM DDR5 không?",
        "Tôi muốn laptop có độ sáng màn hình cao nhất.",
        "Laptop nào tốt cho công việc văn phòng di động?",
        "Tôi muốn laptop có thiết kế đẹp và hiệu suất tốt.",
        "Bạn có dòng laptop nào của MSI không?",
        "Tôi cần laptop có trọng lượng dưới 1.5kg.",
        "Laptop nào có tính năng bảo mật cao nhất?",
        "Tôi muốn biết các dòng laptop có màn hình tần số quét 120Hz.",
        "Bạn có laptop nào với giá ưu đãi không?",
        "Tôi muốn laptop có bàn phím cơ tích hợp.",
        "Laptop nào của ASUS có GPU RTX mạnh?",
        "Tôi muốn laptop với màn hình rộng để làm việc.",
        "Tôi muốn tìm laptop của Dell có giá dưới 15 triệu và màn hình 15 inch.",
        "Laptop HP nào giá dưới 20 triệu và có RAM 8GB?",
        "Bạn có thể giới thiệu laptop ASUS có cấu hình mạnh, màn hình 14 inch và giá dưới 25 triệu không?",
        "Laptop nào của Lenovo có màn hình 4K và CPU Intel i7 dưới 30 triệu?",
        "Tôi cần laptop của Acer với giá dưới 10 triệu, có ổ SSD và RAM 16GB.",
        "Có laptop nào của Apple dưới 40 triệu với màn hình Retina và RAM 8GB không?",
        "Laptop nào của MSI có card đồ họa rời và giá khoảng 25 triệu?",
        "Tôi muốn laptop của Dell với giá dưới 20 triệu và ổ cứng 1TB.",
        "Laptop ASUS nào có giá dưới 30 triệu, màn hình 17 inch và RAM 16GB?",
        "Có laptop nào của HP dưới 15 triệu với GPU NVIDIA và RAM 8GB không?",
        "Tôi muốn laptop của Lenovo có cấu hình mạnh, giá dưới 25 triệu và màn hình Full HD.",
        "Laptop nào của Acer có RAM 32GB, màn hình 15.6 inch và giá dưới 35 triệu?",
        "Tôi cần laptop của ASUS có màn hình 13 inch và giá dưới 20 triệu.",
        "Có laptop nào của Apple với CPU M1 và giá dưới 30 triệu không?",
        "Laptop nào của MSI có RAM 16GB, màn hình 14 inch và giá dưới 25 triệu?",
        "Tôi muốn laptop của HP có giá dưới 18 triệu với cấu hình mạnh, màn hình 15.6 inch.",
        "Laptop ASUS nào có màn hình OLED, CPU Intel i7 và giá dưới 40 triệu?",
        "Có laptop nào của Dell với màn hình 17 inch, RAM 8GB và giá dưới 20 triệu không?",
        "Tôi cần laptop có cấu hình mạnh từ Acer, màn hình 15 inch và giá dưới 30 triệu.",
        "Laptop nào của Apple có màn hình Retina, RAM 8GB và giá dưới 35 triệu?",
        "Laptop ASUS nào có GPU rời, màn hình 15 inch và giá dưới 25 triệu?",
        "Bạn có laptop HP nào giá dưới 12 triệu, có ổ SSD và màn hình Full HD không?",
        "Laptop nào của Lenovo có RAM 8GB, màn hình 14 inch và giá dưới 15 triệu?",
        "Tôi muốn tìm laptop của ASUS có card đồ họa rời và giá dưới 30 triệu.",
        "Laptop Dell nào có ổ SSD, RAM 16GB và giá dưới 25 triệu?",
        "Bạn có laptop Acer nào giá dưới 20 triệu, màn hình 15.6 inch và RAM 8GB không?",
        "Laptop nào của MSI có màn hình 14 inch, giá dưới 20 triệu và RAM 8GB?",
        "Tôi cần laptop của Apple với màn hình 13 inch, CPU M1 và giá dưới 40 triệu.",
        "Laptop ASUS nào có GPU rời, màn hình 15 inch và giá dưới 25 triệu?",
        "Có laptop Dell nào có màn hình 13 inch, giá dưới 20 triệu và RAM 16GB không?",
        "Tôi muốn laptop của Acer có màn hình Full HD, giá dưới 15 triệu và cấu hình mạnh.",
        "Laptop nào của Lenovo có giá dưới 30 triệu, màn hình 17 inch và RAM 8GB?",
        "Tôi muốn tìm laptop của Apple với màn hình Retina, RAM 16GB và giá dưới 40 triệu.",
        "Có laptop nào của HP giá dưới 12 triệu, màn hình 15.6 inch và cấu hình mạnh không?",
        "Laptop ASUS nào có RAM 32GB, màn hình 4K và giá dưới 35 triệu?",
        "Tôi cần laptop Dell có ổ SSD, giá dưới 18 triệu và màn hình Full HD.",
        "Laptop Acer nào có giá dưới 25 triệu, màn hình 14 inch và GPU rời?",
        "Tôi muốn laptop HP có RAM 16GB, màn hình 15.6 inch và giá dưới 20 triệu.",
        "Laptop Lenovo nào có màn hình 15 inch, RAM 8GB và giá dưới 20 triệu?",
        "Tôi muốn laptop Dell có cấu hình cao, giá dưới 30 triệu và màn hình 17 inch.",
        "Laptop nào của ASUS có màn hình OLED, GPU NVIDIA và giá dưới 35 triệu?",
        "Tôi cần laptop của MSI có GPU RTX 3060, màn hình 15 inch và giá dưới 40 triệu.",
        "Laptop nào của Acer có ổ SSD, RAM 16GB và giá dưới 25 triệu?",
        "Tôi muốn tìm laptop của Apple có CPU M1, màn hình 13 inch và giá dưới 40 triệu.",
        "Laptop Dell nào có màn hình 14 inch, giá dưới 15 triệu và RAM 8GB?",
        "Tôi muốn laptop của ASUS có màn hình 13 inch, giá dưới 20 triệu và RAM 8GB.",
        "Laptop nào của Lenovo có màn hình Full HD, giá dưới 25 triệu và cấu hình mạnh?",
        "Tôi cần laptop của MSI có GPU RTX 3070, màn hình 15 inch và giá dưới 40 triệu.",
        "Laptop nào của HP có card đồ họa rời, RAM 16GB và giá dưới 30 triệu?",
        "Tôi muốn tìm laptop của Acer với màn hình 14 inch, giá dưới 20 triệu và cấu hình mạnh.",
        "Laptop Dell nào có màn hình 17 inch, GPU rời và giá dưới 30 triệu?",
        "Tôi muốn laptop của ASUS có ổ SSD 1TB, màn hình 15 inch và giá dưới 40 triệu.",
        "Laptop nào của MSI có giá dưới 30 triệu và hỗ trợ chơi game tốt?",
        "Tôi cần laptop Lenovo có màn hình 4K, CPU Intel i7 và giá dưới 35 triệu.",
        "Laptop Acer nào có cấu hình mạnh, màn hình Full HD và giá dưới 20 triệu?",
        "Tôi muốn laptop Apple với CPU M1, màn hình 13 inch và giá dưới 30 triệu.",
        "Laptop nào của ASUS có màn hình 15 inch, RAM 8GB và giá dưới 25 triệu?",
        "Tôi cần laptop của Dell với màn hình 13 inch, giá dưới 20 triệu và RAM 8GB.",
        "Laptop Lenovo nào có cấu hình mạnh, màn hình 14 inch và giá dưới 25 triệu?",
        "Laptop MSI nào có card đồ họa NVIDIA, giá dưới 30 triệu và RAM 16GB?",
        "Tôi cần laptop HP có màn hình 15 inch, ổ SSD và giá dưới 20 triệu.",
        "Laptop Dell nào có màn hình 13 inch, giá dưới 20 triệu và cấu hình mạnh?",
        "Tôi muốn laptop của ASUS có màn hình 14 inch, RAM 16GB và giá dưới 30 triệu.",
        "Laptop nào của Lenovo có màn hình 15 inch, RAM 8GB và giá dưới 15 triệu?",
        "Tôi cần laptop của MSI có màn hình 15 inch, GPU rời và giá dưới 35 triệu.",
        "Laptop Dell nào có cấu hình cao, giá dưới 30 triệu và RAM 16GB?",
        "Tôi muốn laptop của Apple có màn hình Retina, RAM 8GB và giá dưới 40 triệu.",
        "Laptop ASUS nào có màn hình 4K, RAM 16GB và giá dưới 40 triệu?",
        "Tôi muốn laptop HP có card đồ họa rời, màn hình 15 inch và giá dưới 20 triệu.",
        "Laptop nào của Acer có màn hình Full HD, RAM 8GB và giá dưới 25 triệu?",
        "Tôi cần laptop ASUS có ổ SSD 512GB, màn hình 14 inch và giá dưới 30 triệu.",
        "Laptop Dell nào có giá dưới 25 triệu và hỗ trợ chơi game tốt?",
        "Tôi muốn laptop của Lenovo với màn hình 17 inch, giá dưới 35 triệu.",
        "Laptop nào của Apple có màn hình Retina, CPU M1 và giá dưới 40 triệu?",
        "Tôi cần laptop của ASUS với màn hình OLED, RAM 16GB và giá dưới 40 triệu.",
        "Laptop MSI nào có màn hình 15 inch, cấu hình mạnh và giá dưới 35 triệu?",
        "Tôi muốn laptop Dell có màn hình Full HD, GPU rời và giá dưới 30 triệu.",
        "Laptop nào của Lenovo có màn hình 14 inch, RAM 16GB và giá dưới 25 triệu?",
        "Tôi cần laptop của HP có màn hình 13 inch, giá dưới 20 triệu và RAM 8GB.",
        "Laptop Dell nào có màn hình 15.6 inch, ổ SSD và giá dưới 25 triệu?",
        "Tôi muốn laptop của Acer có giá dưới 30 triệu, màn hình 15 inch và RAM 16GB.",
        "Laptop nào của MSI có màn hình Full HD, GPU rời và giá dưới 40 triệu?",
        "Tôi cần laptop của ASUS có màn hình OLED, CPU Intel i7 và giá dưới 35 triệu.",
        "Laptop Dell nào có cấu hình mạnh, giá dưới 25 triệu và màn hình 17 inch?"
      ],
      "responses": [
        "Đây là các laptop phù hợp với nhu cầu của bạn:",
        "Hãy thử tham khảo các mẫu laptop dưới đây:"
      ]
    },
    {
      "tag": "no-content",
      "patterns": [
        "Hôm nay trời đẹp quá",
        "Bạn có biết bây giờ là mấy giờ không?",
        "Con mèo nhà tôi mới sinh con",
        "Tôi cần tư vấn về hoa kiểng",
        "Có nên đi chơi hôm nay không nhỉ?",
        "Tôi muốn biết cách làm món ăn này",
        "Bạn có thể chỉ tôi cách chụp ảnh đẹp không?",
        "Tôi muốn nói chuyện với bạn về thời tiết",
        "Nghe nói phim đó rất hay, bạn nghĩ sao?",
        "Tôi muốn học thêm về tiếng Anh",
        "Giá cả thị trường thay đổi như thế nào?",
        "Làm sao để tập yoga hiệu quả?",
        "Bạn biết chỗ nào sửa điện thoại tốt không?",
        "Có ai biết tin tức mới nhất về bóng đá không?",
        "Giải thích cho tôi về lý thuyết lượng tử",
        "Công thức nấu món phở bò là gì?",
        "Mùa này nên trồng loại cây gì?",
        "Tư vấn giùm tôi cách làm bánh sinh nhật",
        "Thời tiết ngày mai thế nào nhỉ?",
        "Có ai biết cách chăm sóc da hiệu quả không?",
        "Tôi muốn đăng ký lớp học múa",
        "Cách tiết kiệm điện trong gia đình là gì?",
        "Làm thế nào để nuôi dạy trẻ thông minh?",
        "Tôi thích đi du lịch, có gợi ý không?",
        "Phim nào đang hot trên Netflix?",
        "Ai là ca sĩ nổi tiếng hiện nay?",
        "Làm sao để viết một bài luận tốt?",
        "Bạn nghĩ sao về việc tập gym mỗi ngày?",
        "Có quán cà phê nào yên tĩnh không?",
        "Giải thích cho tôi về thuyết tương đối",
        "Tôi cần giúp đỡ với việc nuôi cá cảnh",
        "Có ai có kinh nghiệm chăm sóc cây xương rồng?",
        "Tư vấn giúp tôi chọn một chiếc xe đạp",
        "Làm thế nào để tăng cường sức khỏe?",
        "Bạn có thể chỉ tôi cách sửa máy giặt không?",
        "Có ai biết địa chỉ tiệm bánh ngon không?",
        "Cách trồng rau sạch tại nhà là gì?",
        "Giới thiệu cho tôi sách hay về tâm lý học",
        "Nên mặc trang phục gì cho buổi tiệc tối?",
        "Tôi muốn học cách vẽ tranh",
        "Bí quyết để giữ gìn sức khỏe tốt là gì?",
        "Bạn nghĩ sao về phong cách thời trang mới?",
        "Có nơi nào yên tĩnh để đọc sách không?",
        "Mua hoa quả ở đâu là an toàn?",
        "Tôi cần học cách giao tiếp hiệu quả",
        "Làm sao để có một giấc ngủ ngon?",
        "Tôi muốn nuôi chó, cần lưu ý gì?",
        "Bạn có đề xuất địa điểm du lịch nào?",
        "Tôi đang tìm cách học thêm về marketing",
        "Có cách nào giảm căng thẳng nhanh chóng không?",
        "Nên chọn loại cây gì cho bàn làm việc?",
        "Bạn biết về các công thức làm đẹp không?",
        "Tôi cần tư vấn về phong cách sống lành mạnh",
        "Có ai biết cách sửa bếp ga không?",
        "Làm sao để có kỹ năng lãnh đạo tốt?",
        "Tôi đang cần tìm lớp học làm đồ gốm",
        "Chào buổi sáng, bạn có khỏe không?",
        "Tôi vừa mua một chiếc xe mới, bạn nghĩ sao?",
        "Tôi vừa tham gia lớp học yoga, rất thú vị!",
        "Có thể giới thiệu cho tôi vài bộ phim hay không?",
        "Tôi đang tìm cách giảm cân hiệu quả, bạn có bí quyết nào không?",
        "Bạn có thể tư vấn giúp tôi về việc chọn quà sinh nhật?",
        "Mới đây tôi học được cách nấu món bánh mì rất ngon!",
        "Ai biết một quán cà phê yên tĩnh để làm việc không?",
        "Tôi muốn cải thiện khả năng viết lách của mình, bạn có lời khuyên nào không?",
        "Mình vừa mới xem một bộ phim rất hay, bạn đã xem chưa?",
        "Tôi đang học cách làm vườn, có thể cho tôi vài lời khuyên không?",
        "Làm sao để nuôi mèo tốt hơn?",
        "Tôi muốn bắt đầu học tiếng Trung, bạn có gợi ý gì không?",
        "Có thể chia sẻ những kỹ thuật làm vườn hiệu quả không?",
        "Tôi muốn học cách trang điểm, bạn có thể giúp không?",
        "Mới đây tôi bắt đầu học cách chơi guitar, rất vui!",
        "Tôi đang tìm một cuốn sách hay để đọc, có gợi ý nào không?",
        "Tôi cần chuẩn bị một chuyến du lịch, bạn có mẹo nào không?",
        "Bạn có thể giới thiệu những app học tiếng Anh nào tốt?",
        "Mới đây tôi tìm thấy một quán ăn rất ngon, bạn có biết không?",
        "Làm sao để quản lý thời gian hiệu quả hơn?",
        "Tôi muốn học cách làm đồ handmade, bạn có gợi ý gì không?",
        "Tôi đang tìm cách cải thiện khả năng nghe nhạc, bạn có lời khuyên gì?",
        "Tôi đang tìm các phương pháp giảm stress hiệu quả, có ai có gợi ý không?",
        "Tôi đang muốn học kỹ năng lãnh đạo, có khóa học nào phù hợp không?",
        "Tôi vừa mới tham gia một buổi hội thảo rất thú vị, bạn có tham gia không?",
        "Tôi muốn tìm hiểu về các loại cây trồng trong nhà, bạn có kinh nghiệm gì không?",
        "Tôi đang muốn mua một chiếc điện thoại mới, bạn có gợi ý nào không?",
        "Làm sao để cải thiện sức khỏe thể chất?",
        "Tôi muốn học cách vẽ tranh chân dung, có thể giúp tôi không?",
        "Mới đây tôi có mua một chiếc đồng hồ mới, bạn có thích không?",
        "Làm sao để làm việc hiệu quả hơn mỗi ngày?",
        "Tôi đang muốn học thêm về lập trình, có gợi ý nào không?",
        "Mình muốn tìm một quán ăn ngon ở Hà Nội, có ai biết không?",
        "Bạn có thể cho tôi biết cách trang trí phòng ngủ đẹp không?",
        "Mình đang muốn học cách làm bánh, có ai biết không?",
        "Tôi đang muốn cải thiện khả năng giao tiếp, có mẹo nào không?",
        "Tôi vừa tham gia một lớp học nấu ăn, rất thú vị!",
        "Có thể giới thiệu cho tôi một bộ phim hay không?",
        "Tôi muốn biết cách chăm sóc tóc, bạn có bí quyết gì không?",
        "Làm sao để có một lối sống lành mạnh và năng động?",
        "Tôi muốn bắt đầu học nhảy, có lớp học nào không?",
        "Làm sao để tiết kiệm tiền hiệu quả?",
        "Tôi muốn tìm một quán ăn sáng ngon, bạn có biết chỗ nào không?",
        "Có thể chia sẻ cho tôi về các mẹo sống tối giản không?",
        "Tôi muốn học về cách tạo dựng mối quan hệ trong công việc, có lời khuyên nào không?",
        "Bạn có thể giúp tôi tìm hiểu thêm về sự nghiệp phát triển cá nhân?"
      ],
      "responses": [
        "Xin lỗi, tôi không hiểu yêu cầu của bạn. Bạn có thể hỏi về các sản phẩm laptop hoặc dịch vụ của chúng tôi.",
        "Tôi không chắc là mình có thể giúp bạn với câu hỏi này. Vui lòng đặt câu hỏi về laptop hoặc các phụ kiện liên quan.",
        "Có vẻ như câu hỏi của bạn không liên quan đến lĩnh vực laptop. Bạn có thể hỏi tôi về các sản phẩm và tính năng laptop nếu cần hỗ trợ.",
        "Xin lỗi, tôi hiện tại chỉ hỗ trợ các câu hỏi liên quan đến laptop và các dịch vụ liên quan. Vui lòng thử lại với một câu hỏi khác.",
        "Bạn đang cần tư vấn về laptop? Vui lòng đặt câu hỏi rõ hơn để tôi có thể hỗ trợ bạn tốt hơn.",
        "Hiện tại, tôi chỉ cung cấp thông tin về các sản phẩm và phụ kiện laptop. Vui lòng thử đặt câu hỏi khác liên quan đến chủ đề này nhé!"
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "Xin chào",
        "Chào bạn",
        "Hello",
        "Hi",
        "Chào",
        "Chào bạn nhé",
        "Hey",
        "Xin chào, bạn khỏe không?",
        "Chào nhé",
        "Tôi muốn bắt đầu",
        "Cho tôi hỏi chút nhé",
        "Chào chatbot",
        "Xin chào bạn",
        "Chào nhân viên tư vấn",
        "Tôi muốn nói chuyện với bạn",
        "Tôi có thể giúp gì cho bạn?",
        "Bạn có đây không?",
        "Hello chatbot",
        "Chào bạn, có ai ở đây không?",
        "Xin chào, tôi cần hỗ trợ",
        "Chào bạn, hôm nay thế nào?",
        "Xin chào, tôi cần trợ giúp",
        "Hi, bạn có thể giúp tôi không?",
        "Chào bạn, bạn có sẵn sàng giúp tôi không?",
        "Hello, tôi muốn tìm hiểu về laptop",
        "Chào, tôi đang cần tư vấn",
        "Chào chatbot, tôi muốn hỏi về sản phẩm",
        "Hi, tôi có thể hỏi bạn về máy tính được không?",
        "Chào bạn, tôi muốn tìm hiểu thêm về laptop",
        "Xin chào, bạn có thể giúp tôi không?",
        "Chào, tôi đang tìm laptop cho công việc",
        "Hi! Tôi đang tìm hiểu về các sản phẩm laptop",
        "Hello, tôi cần giúp đỡ một chút về laptop",
        "Chào bạn, có thể giúp tôi tìm laptop phù hợp không?",
        "Xin chào, tôi muốn tư vấn về laptop cho công việc",
        "Chào bạn, tôi đang tìm laptop mới",
        "Chào bạn, tôi muốn tìm laptop cho học tập",
        "Hi, tôi cần tìm một chiếc laptop để chơi game",
        "Chào, tôi cần laptop cho công việc thiết kế đồ họa",
        "Xin chào, tôi đang muốn mua laptop để học trực tuyến",
        "Hello, tôi cần một chiếc laptop mạnh mẽ cho công việc",
        "Chào bạn, bạn có thể giới thiệu laptop cho sinh viên không?",
        "Hi, tôi cần tìm laptop giá rẻ nhưng vẫn mạnh mẽ",
        "Chào bạn, bạn có thể tư vấn về laptop cho tôi không?",
        "Chào chatbot, tôi cần tìm laptop với cấu hình cao",
        "Xin chào, tôi muốn mua laptop nhưng chưa biết chọn mẫu nào",
        "Hello, tôi muốn hỏi về các laptop mỏng nhẹ nhưng hiệu suất cao",
        "Chào bạn, bạn có thể giúp tôi tìm hiểu về các dòng laptop mới nhất không?",
        "Hi, tôi đang tìm một chiếc laptop phù hợp với nhu cầu công việc văn phòng",
        "Chào bạn, tôi muốn biết thông tin về laptop chơi game",
        "Xin chào, bạn có thể chỉ tôi laptop nào phù hợp với nhu cầu học tập?",
        "Chào, tôi đang tìm chiếc laptop vừa bền vừa đẹp",
        "Hi, bạn có thể giới thiệu laptop có màn hình đẹp không?",
        "Xin chào, tôi cần tư vấn về laptop cho việc chỉnh sửa video",
        "Chào bạn, tôi đang muốn nâng cấp laptop cũ",
        "Hello, bạn có laptop nào có thời gian sử dụng pin lâu không?",
        "Hi, tôi cần một chiếc laptop chạy mượt mà các phần mềm đồ họa",
        "Chào, tôi muốn biết laptop nào tốt cho việc học lập trình",
        "Xin chào, tôi đang tìm laptop có cấu hình mạnh mẽ cho việc chơi game",
        "Hello, tôi muốn tìm chiếc laptop có thiết kế đẹp và tiện lợi",
        "Chào bạn, tôi đang tìm laptop để phục vụ công việc văn phòng",
        "Chào bạn, tôi cần một chiếc laptop với dung lượng lưu trữ lớn",
        "Hi, bạn có laptop nào nhẹ và dễ mang theo không?",
        "Chào, tôi muốn hỏi về các tính năng của laptop Dell",
        "Chào bạn, tôi muốn tìm laptop chơi game với giá hợp lý",
        "Xin chào, tôi đang muốn mua laptop cho nhu cầu học trực tuyến",
        "Hi, bạn có thể giúp tôi tìm laptop có màn hình lớn không?",
        "Chào bạn, bạn có thể giới thiệu laptop có hiệu suất tốt cho việc làm việc đa nhiệm không?",
        "Hello, tôi cần một chiếc laptop có card đồ họa mạnh",
        "Xin chào, tôi cần tìm laptop có camera chất lượng tốt cho họp online",
        "Chào bạn, tôi đang tìm laptop có thiết kế mỏng nhẹ cho công việc",
        "Hi, tôi muốn biết laptop nào có tính năng bảo mật tốt",
        "Chào bạn, tôi cần laptop phù hợp với nhu cầu học và làm việc",
        "Hello, tôi muốn tìm laptop với hiệu suất cao nhưng giá hợp lý",
        "Chào bạn, tôi cần tìm laptop có thể chạy mượt các phần mềm văn phòng",
        "Xin chào, tôi muốn biết thêm về laptop dành cho sinh viên",
        "Chào bạn, tôi đang tìm laptop có bộ vi xử lý mạnh",
        "Hi, tôi cần laptop có khả năng chạy các phần mềm chỉnh sửa ảnh",
        "Chào, tôi đang tìm laptop có thời gian bảo hành dài",
        "Chào bạn, tôi cần laptop có bộ nhớ trong lớn để lưu trữ dữ liệu",
        "Hello, tôi muốn tìm laptop với màn hình cảm ứng",
        "Hi, tôi muốn hỏi về laptop có tính năng chống chói",
        "Chào, tôi muốn tìm laptop có khả năng kết nối tốt với các thiết bị khác",
        "Xin chào, bạn có thể giới thiệu cho tôi laptop có nhiều cổng kết nối không?",
        "Chào bạn, tôi cần laptop có thời gian khởi động nhanh",
        "Hi, tôi muốn mua một chiếc laptop có thể làm việc liên tục mà không bị nóng",
        "Chào bạn, bạn có laptop nào có tính năng tự động cập nhật phần mềm không?",
        "Hello, tôi đang tìm laptop có âm thanh tốt cho công việc và giải trí",
        "Xin chào, bạn có thể tư vấn giúp tôi về laptop tốt cho việc làm video không?",
        "Chào bạn, tôi cần laptop có khả năng sử dụng lâu dài mà không bị lỗi",
        "Hi, tôi cần một chiếc laptop mạnh mẽ nhưng dễ sử dụng",
        "Chào, tôi muốn tìm hiểu laptop cho học sinh cấp 3",
        "Chào bạn, bạn có thể tư vấn laptop phù hợp cho việc chỉnh sửa ảnh không?"
      ],
      "responses": [
        "Chào bạn! Bạn đang tìm laptop nào? Hãy cho tôi biết thêm để tôi có thể giúp bạn.",
        "Hi! Bạn cần tìm hiểu về sản phẩm laptop nào? Tôi có thể tư vấn cho bạn.",
        "Xin chào! Bạn cần hỗ trợ về laptop hay các dịch vụ liên quan đến công nghệ?",
        "Chào bạn! Nếu bạn cần tư vấn về các dòng laptop hoặc phụ kiện, tôi sẽ rất vui được giúp đỡ.",
        "Hello! Tôi có thể hỗ trợ bạn về các dòng laptop mới hoặc những thông tin bạn cần.",
        "Chào bạn, tôi luôn sẵn sàng để giúp bạn tìm kiếm laptop phù hợp với nhu cầu của mình.",
        "Hi! Nếu bạn có câu hỏi về laptop hoặc các thiết bị công nghệ, đừng ngần ngại hỏi tôi nhé!",
        "Chào bạn! Bạn đang cần tư vấn về laptop cho công việc, học tập hay giải trí?",
        "Xin chào, bạn có thể cho tôi biết bạn đang tìm kiếm một chiếc laptop như thế nào không?",
        "Hello, tôi sẽ giúp bạn chọn laptop phù hợp với nhu cầu của bạn. Cần trợ giúp gì không?"
      ]
    }
  ]
}